import createComponent from '@src/utils/createComponent'
import styled from 'styled-components'

export default createComponent({
  id: 'css/shape',
  examples: [
    'examples'
    // '正方形',
    // '长方形',
    // '圆形',
    // '椭圆形',
    // '上三角',
    // '下三角',
    // '左三甲',
    // '右三角',
    // '左上角',
    // '右上角',
    // '左下角',
    // '右下角',
    // '箭头',
    // '梯形',
    // '平行四边形',
    // '星星（6角）',
    // '星星（5角）',
    // '五边形',
    // '六边形',
    // '八边形',
    // '爱心',
    // '无穷大',
    // '菱形',
    // '钻石',
    // '钻戒',
    // '钻石2',
    // '蛋蛋',
    // '吃豆人',
    // '对话泡泡',
    // '12点爆发',
    // '8点爆发',
    // '太极',
    // '徽章丝带',
    // '太空入侵者（电脑游戏名）',
    // '电视',
    // '雪佛龙',
    // '放大镜',
    // 'Facebook图标',
    // '月亮',
    // '棋子',
    // '圆锥',
    // '十字架',
    // '根基',
    // '指示器',
    // '锁'
  ],
  dependencies: {
    styled
  }
})
